Tsung Results/SinglePassenger-M3-20151030-0002/simple.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="54.152.13.253" port="80" type="tcp"/>
  </servers>


  <load>
  	<arrivalphase phase="1" duration="60" unit="second">
    		<users arrivalrate="2" unit="second"/>
  	</arrivalphase>
  	<arrivalphase phase="2" duration="1" unit="minute">
    		<users interarrival="2" unit="second"/>
  	</arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="fetch-welcomepage" probability="100" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>
    </session>
  </sessions>
</tsung>